
INSERT INTO Family (familyname) 
VALUES 
('张三家庭'),
('李四家庭');

INSERT INTO Users (username, password, email, familyid, role) 
VALUES 
('zhangsan', '123456', 'zhangsan@example.com', 1, 1), -- 张三，管理员
('lisi', '123456', 'lisi@example.com', 2, 1),          -- 李四，管理员
('wangwu', '123456', 'wangwu@example.com', 1, 0),      -- 张三家庭成员
('zhaoliu', '123456', 'zhaoliu@example.com', 2, 0);    -- 李四家庭成员

INSERT INTO Budget (familyid, time, amount) 
VALUES 
(1, '2025-11-01', 5400.00),
(1, '2025-12-01', 5600.00),
(2, '2025-11-01', 6700.00),
(2, '2025-12-01', 6800.00);


INSERT INTO TransactionRecord 
(familyid, userid, categoryid, amount, occurred_at, note, merchant, location, paymentmethod) 
VALUES 
(1, 1, 9, 2000.00, '2025-09-10 10:00:00', '项目奖金', '公司A', '杭州', '银行卡'),
(1, 3, 1, 60.00, '2025-09-11 08:30:00', '早餐', '麦当劳', '杭州', '支付宝'),
(1, 3, 3, 35.00, '2025-09-12 18:00:00', '公交', '杭州公交', '杭州', '现金'),
(1, 3, 4, 150.00, '2025-09-13 20:00:00', 'KTV', '欢唱KTV', '杭州', '微信'),
(1, 3, 2, 400.00, '2025-09-14 15:30:00', '购物', '淘宝', '杭州', '支付宝'),
(1, 3, 5, 100.00, '2025-09-15 09:00:00', '买药', '药店', '杭州', '现金'),
(1, 1, 10, 500.00, '2025-09-20 12:00:00', '投资收益', '证券公司', '杭州', '银行卡'),
(1, 3, 6, 300.00, '2025-09-21 14:00:00', '孩子培训班', '教育机构', '杭州', '微信'),
(1, 3, 7, 50.00, '2025-09-22 10:00:00', '其他支出', '便利店', '杭州', '现金');
INSERT INTO TransactionRecord 
(familyid, userid, categoryid, amount, occurred_at, note, merchant, location, paymentmethod) 
VALUES 
(2, 2, 9, 1500.00, '2025-09-10 11:00:00', '奖金', '公司B', '上海', '银行卡'),
(2, 4, 1, 100.00, '2025-09-11 08:30:00', '早餐', '肯德基', '上海', '微信'),
(2, 4, 2, 500.00, '2025-09-12 16:00:00', '购物', '京东', '上海', '支付宝'),
(2, 4, 3, 40.00, '2025-09-13 08:00:00', '地铁', '上海地铁', '上海', '现金'),
(2, 4, 4, 180.00, '2025-09-14 19:00:00', '电影院', 'UME影城', '上海', '微信'),
(2, 2, 10, 800.00, '2025-09-15 09:00:00', '投资收益', '银行', '上海', '银行卡'),
(2, 4, 5, 200.00, '2025-09-16 10:00:00', '医院体检', '医院', '上海', '支付宝'),
(2, 4, 6, 400.00, '2025-09-17 15:00:00', '孩子英语班', '教育机构', '上海', '微信'),
(2, 4, 7, 60.00, '2025-09-18 10:30:00', '其他支出', '便利店', '上海', '现金');